app/Repositories/BlogCategoryRepository.php

    public function getAllWithPaginate($perPage = null)
    {
        $columns = ['id', 'title', 'parent_id'];

        $result = $this
            ->startConditions()
            ->select($columns)
            ->with(['parentCategory:id,title',])
            ->paginate($perPage);
---
select `id`, `title` from `blog_categories` where `blog_categories`.`id` in (0, 1, 2, 3, 4, 6, 11) and `blog_categories`.`deleted_at` is null
select count(*) as aggregate from `blog_categories` where `blog_categories`.`deleted_at` is null