app/Repositories/BlogPostRepository.php

select `id`, `name` from `users` where `users`.`id` in (1, 2)
select `id`, `title` from `blog_categories` where `blog_categories`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11) and `blog_categories`.`deleted_at` is null
---
    public function getAllWithPaginate()
    {
        $columns = [
            'id',
            'title',
            'is_published',
            'published_at',
            'user_id',
            'category_id'
        ];

        $relust = $this->startConditions()
            ->select($columns)
            ->orderBy('id', 'DESC')
            /*жадная загрузка*/
            ->with([
                    'category' => function ($query) {
                    $query->select(['id','title']);
                    },
                    'user:id,name'
                  ])
            ->paginate(25);